stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Src/stm32wb0x_hal_rcc.c
  /* Get the LSE configuration -----------------------------------------------*/
  if (LL_RCC_LSE_IsEnabled())
  {
    RCC_OscInitStruct->LSEState = RCC_LSE_ON;
  }
  else
  {
    RCC_OscInitStruct->LSEState = RCC_LSE_OFF;
  }

  /* Get the LSE Bypass configuration ----------------------------------------*/
  if (LL_RCC_LSE_IsBypassEnabled())
  {
    RCC_OscInitStruct->LSEBYPASSState = RCC_LSE_BYPASS_ON;
  }
  else
  {
    RCC_OscInitStruct->LSEBYPASSState = RCC_LSE_BYPASS_OFF;
  }

  /* Get the LSI configuration -----------------------------------------------*/
  if (LL_RCC_LSI_IsEnabled())
  {
    RCC_OscInitStruct->LSIState = RCC_LSI_ON;
  }
  else
  {
    RCC_OscInitStruct->LSIState = RCC_LSI_OFF;
  }
}

/**
  * @brief  Configure the RCC_ClkInitStruct according to the internal
  *         RCC configuration registers.
  * @param  RCC_ClkInitStruct Pointer to a @ref RCC_ClkInitTypeDef structure that
  *         will be configured.
  * @param  pFLatency Pointer on the Flash Latency.
  * @retval None
  */
void HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t *pFLatency)
{
  /* Check the parameters */
  assert_param(RCC_ClkInitStruct != (void *)NULL);
  assert_param(pFLatency != (void *)NULL);

  /* Set all possible values for the Clock type parameter --------------------*/

  /* Get the SYSCLK configuration --------------------------------------------*/
  if (LL_RCC_DIRECT_HSE_IsEnabled())
  {
    RCC_ClkInitStruct->SYSCLKSource = RCC_SYSCLKSOURCE_DIRECT_HSE;
  }
  else
  {
    RCC_ClkInitStruct->SYSCLKSource = RCC_SYSCLKSOURCE_RC64MPLL;
  }

  /* Get the SYSCLK Divider --------------------------------------------------*/
#if defined(RCC_CFGR_CLKSYSDIV_STATUS)
  RCC_ClkInitStruct->SYSCLKDivider = LL_RCC_GetCLKSYSPrescalerStatus();
#else
  if (LL_RCC_DIRECT_HSE_IsEnabled())
  {
    RCC_ClkInitStruct->SYSCLKDivider = LL_RCC_GetDirectHSEPrescaler();
  }
  else
  {
    RCC_ClkInitStruct->SYSCLKDivider = LL_RCC_GetRC64MPLLPrescaler();
  }
#endif

  /* Get the Flash Wait State (Latency) configuration ------------------------*/
  *pFLatency = __HAL_FLASH_GET_WAIT_STATES();
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
